app/controllers/user/profiles_controller.rb

  def create
    logout_keeping_session!
    @user = SiteUser.new(:login => params[:user][:login],
										 		 :email => params[:user][:email],
										 		 :name => params[:user][:name],
										 		 :password => params[:user][:password],
										 		 :password_confirmation => params[:user][:password_confirmation],
												 :invitation_token => params[:user][:invitation_token])
		@role = Role.find_by_name("user")
		@user.roles << @role
    success = @user && @user.save
    if success && @user.errors.empty?
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `activation_code`, `password_reset_code`, `enabled`, `invitation_id`, `user_type`, `remember_token`, `identity_url`, `login`, `email`, `created_at`, `invitation_limit`) VALUES('Gunnar Magholder', 'b102a4d38e48fd9ecc1f9034267ffd289fb7adb8', '2008-12-15 10:25:37', '2008-12-15 10:25:37', '9cc84e30e191d4c595eceaafc09ec62e0d728e86', NULL, '58ce156b2073e54163f8bff09074b7586f3fcda5', NULL, 1, 1, 'SiteUser', NULL, NULL, 'gmagholder', 'gmagholder@mac.com', '2008-12-15 10:25:37', 5)
SELECT `users`.id FROM `users` WHERE (`users`.`login` = BINARY 'gmagholder') LIMIT 1