app/controllers/entries_controller.rb

  def index
    # @entries = Entry.find(:all, :conditions => ['user_id = ? and project_ID IS NOT NULL', current_user.id ], :order => "edate DESC", :limit => 10, :include => :project)
    @entries = Entry.paginate :per_page => 10, :page => params[:page], :order => "edate DESC",
                              :conditions => ['user_id = ? and project_ID IS NOT NULL ', current_user.id ]
---
SELECT * FROM `entries`