app/controllers/entries_controller.rb

  def index
    @entries = Entry.find(:all, :conditions => ['user_id = ? and project_ID IS NOT NULL', current_user.id ], :order => "edate DESC", :limit => 10, :include => :project)
---
SELECT * FROM `entries` WHERE (user_id = 1 and project_ID IS NOT NULL) ORDER BY edate DESC LIMIT 10
SELECT * FROM `projects` WHERE (`projects`.`id` IN (1,2))

  def show_all
  	@entries = Entry.find(:all, :conditions => ['user_id = ? and project_ID IS NOT NULL', current_user.id ], :order => "edate DESC", :include => :project)
---
SELECT * FROM `entries` WHERE (user_id = 1 and project_ID IS NOT NULL) ORDER BY edate DESC
SELECT * FROM `projects` WHERE (`projects`.`id` IN (1,2))

  def incomplete
  	@entries = Entry.find(:all, :conditions => ['user_id = ? and project_ID IS NOT NULL and endtime is NULL', current_user.id ], :order => "edate DESC", :include => :project)
---
SELECT * FROM `entries` WHERE (user_id = 1 and project_ID IS NOT NULL and endtime is NULL) ORDER BY edate DESC
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def show
    @entry = Entry.find(:all, :conditions => ['user_id = ? AND id = ?',current_user.id,params[:id]]).first
---
SELECT * FROM `entries` WHERE (user_id = 50006 AND id = '48')

  def edit
    @entry = Entry.find(params[:id])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 48)

  def create
    @entry = Entry.new(params[:entry])
    @entry.user = current_user
    respond_to do |format|
      if @entry.save
---
INSERT INTO `entries` (`project_id`, `endtime`, `updated_at`, `notes`, `user_id`, `edate`, `starttime`, `created_at`) VALUES(2, NULL, '2008-11-12 20:59:45', '', 1, '2008-11-13', '2000-01-01 21:59:00', '2008-11-12 20:59:45')

  def update
    @entry = Entry.find(params[:id])
    @entry.user = current_user
    respond_to do |format|
      if @entry.update_attributes(params[:entry])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 48)
UPDATE `entries` SET `endtime` = '2000-01-01 21:51:00', `updated_at` = '2008-12-23 20:56:03', `project_id` = 10 WHERE `id` = 48

  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 41)
DELETE FROM `entries`

  def stop
    @entry = Entry.find(params[:id])
    @entry.update_attribute :endtime, Time.now
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 48)
UPDATE `entries` SET `endtime` = '2008-12-23 21:51:11', `updated_at` = '2008-12-23 20:51:11' WHERE `id` = 48