app/controllers/projects_controller.rb

  def index
    @projects = Project.find(:all, :conditions => ['(user_id = ? and name LIKE ?) or (user_id = ? and name LIKE ?) ', current_user.id, "%#{params[:search]}%", current_user.managed_by, "%#{params[:search]}%" ])
---
SELECT * FROM `projects` WHERE ((user_id = 50007 and name LIKE '%%') or (user_id = NULL and name LIKE '%%') )

  def show
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 13)

  def edit
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def create
    @project = Project.new(params[:project])
    @project.user = current_user
    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`name`, `custname`, `updated_at`, `duedate`, `user_id`, `budget`, `created_at`) VALUES('Internal Test Project', 'internal', '2008-12-23 22:59:58', '2008-12-23 22:59:00', 50007, NULL, '2008-12-23 22:59:58')