app/controllers/report_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def index
    @user = current_user
    if current_user.isRole('manager')
      @colleagues = User.find(:all, :conditions => {:managed_by => current_user.id})